7767517
282 289
Input                    input                    0 1 input
Convolution              conv_48                  1 1 input 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
ConvolutionDepthWise     convdw_87                1 1 1 2 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=144 7=16
MemoryData               p2o.pd_op.reshape.0.0    0 1 3 0=1 1=1 2=16
BinaryOp                 add_0                    2 1 2 3 4 0=0
BinaryOp                 mul_1                    1 1 4 5 0=2 1=1 2=1.384107e+00
BinaryOp                 add_2                    1 1 5 6 0=0 1=1 2=5.860772e-01
HardSwish                hswish_10                1 1 6 7 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_3                    1 1 7 8 0=2 1=1 2=1.675188e-01
BinaryOp                 add_4                    1 1 8 9 0=0 1=1 2=3.470043e-05
Convolution              conv_49                  1 1 9 10 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=512
MemoryData               p2o.pd_op.reshape.1.0    0 1 11 0=1 1=1 2=32
BinaryOp                 add_5                    2 1 10 11 12 0=0
BinaryOp                 mul_6                    1 1 12 13 0=2 1=1 2=2.111558e+00
BinaryOp                 add_7                    1 1 13 14 0=0 1=1 2=1.056320e+00
HardSwish                hswish_11                1 1 14 15 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_8                    1 1 15 16 0=2 1=1 2=1.828085e-01
BinaryOp                 add_9                    1 1 16 17 0=0 1=1 2=-2.008548e-01
ConvolutionDepthWise     convdw_88                1 1 17 18 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=288 7=32
MemoryData               p2o.pd_op.reshape.2.0    0 1 19 0=1 1=1 2=32
BinaryOp                 add_10                   2 1 18 19 20 0=0
BinaryOp                 mul_11                   1 1 20 21 0=2 1=1 2=2.166723e+00
BinaryOp                 add_12                   1 1 21 22 0=0 1=1 2=1.000862e+00
HardSwish                hswish_12                1 1 22 23 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_13                   1 1 23 24 0=2 1=1 2=6.063076e-02
BinaryOp                 add_14                   1 1 24 25 0=0 1=1 2=-4.069060e-05
Convolution              conv_50                  1 1 25 26 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=2048
MemoryData               p2o.pd_op.reshape.3.0    0 1 27 0=1 1=1 2=64
BinaryOp                 add_15                   2 1 26 27 28 0=0
BinaryOp                 mul_16                   1 1 28 29 0=2 1=1 2=2.172230e+00
BinaryOp                 add_17                   1 1 29 30 0=0 1=1 2=8.583514e-01
HardSwish                hswish_13                1 1 30 31 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_18                   1 1 31 32 0=2 1=1 2=4.061948e-01
BinaryOp                 add_19                   1 1 32 33 0=0 1=1 2=-2.785621e-01
ConvolutionDepthWise     convdw_89                1 1 33 34 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=576 7=64
MemoryData               p2o.pd_op.reshape.4.0    0 1 35 0=1 1=1 2=64
BinaryOp                 add_20                   2 1 34 35 36 0=0
BinaryOp                 mul_21                   1 1 36 37 0=2 1=1 2=3.069615e+00
BinaryOp                 add_22                   1 1 37 38 0=0 1=1 2=3.243599e-01
HardSwish                hswish_14                1 1 38 39 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_23                   1 1 39 40 0=2 1=1 2=3.095054e-02
BinaryOp                 add_24                   1 1 40 41 0=0 1=1 2=-4.651240e-05
Convolution              conv_51                  1 1 41 42 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=4096
MemoryData               p2o.pd_op.reshape.5.0    0 1 43 0=1 1=1 2=64
BinaryOp                 add_25                   2 1 42 43 44 0=0
BinaryOp                 mul_26                   1 1 44 45 0=2 1=1 2=2.164231e+00
BinaryOp                 add_27                   1 1 45 46 0=0 1=1 2=4.336767e-01
HardSwish                hswish_15                1 1 46 47 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_28                   1 1 47 48 0=2 1=1 2=4.283067e-01
BinaryOp                 add_29                   1 1 48 49 0=0 1=1 2=-8.378658e-02
ConvolutionDepthWise     convdw_90                1 1 49 50 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=1 4=1 5=0 6=576 7=64
MemoryData               p2o.pd_op.reshape.6.0    0 1 51 0=1 1=1 2=64
BinaryOp                 add_30                   2 1 50 51 52 0=0
BinaryOp                 mul_31                   1 1 52 53 0=2 1=1 2=2.293733e+00
BinaryOp                 add_32                   1 1 53 54 0=0 1=1 2=1.019056e+00
HardSwish                hswish_16                1 1 54 55 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_33                   1 1 55 56 0=2 1=1 2=3.271981e-02
BinaryOp                 add_34                   1 1 56 57 0=0 1=1 2=-2.652152e-06
Convolution              conv_52                  1 1 57 58 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=8192
MemoryData               p2o.pd_op.reshape.7.0    0 1 59 0=1 1=1 2=128
BinaryOp                 add_35                   2 1 58 59 60 0=0
BinaryOp                 mul_36                   1 1 60 61 0=2 1=1 2=1.768801e+00
BinaryOp                 add_37                   1 1 61 62 0=0 1=1 2=2.181246e-01
HardSwish                hswish_17                1 1 62 63 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_38                   1 1 63 64 0=2 1=1 2=7.304567e-01
BinaryOp                 add_39                   1 1 64 65 0=0 1=1 2=-8.572540e-02
ConvolutionDepthWise     convdw_91                1 1 65 66 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=1152 7=128
MemoryData               p2o.pd_op.reshape.8.0    0 1 67 0=1 1=1 2=128
BinaryOp                 add_40                   2 1 66 67 68 0=0
BinaryOp                 mul_41                   1 1 68 69 0=2 1=1 2=2.623634e+00
BinaryOp                 add_42                   1 1 69 70 0=0 1=1 2=-7.918281e-03
HardSwish                hswish_18                1 1 70 71 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_43                   1 1 71 72 0=2 1=1 2=4.377005e-02
BinaryOp                 add_44                   1 1 72 73 0=0 1=1 2=5.633773e-05
Convolution              conv_53                  1 1 73 74 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=16384
MemoryData               p2o.pd_op.reshape.9.0    0 1 75 0=1 1=1 2=128
BinaryOp                 add_45                   2 1 74 75 76 0=0
BinaryOp                 mul_46                   1 1 76 77 0=2 1=1 2=1.893770e+00
BinaryOp                 add_47                   1 1 77 78 0=0 1=1 2=-4.865660e-02
HardSwish                hswish_19                1 1 78 79 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_48                   1 1 79 80 0=2 1=1 2=6.528459e-01
BinaryOp                 add_49                   1 1 80 81 0=0 1=1 2=7.379292e-02
ConvolutionDepthWise     convdw_92                1 1 81 82 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=2 4=1 5=0 6=1152 7=128
MemoryData               p2o.pd_op.reshape.10.0   0 1 83 0=1 1=1 2=128
BinaryOp                 add_50                   2 1 82 83 84 0=0
BinaryOp                 mul_51                   1 1 84 85 0=2 1=1 2=2.482111e+00
BinaryOp                 add_52                   1 1 85 86 0=0 1=1 2=6.599923e-01
HardSwish                hswish_20                1 1 86 87 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_53                   1 1 87 88 0=2 1=1 2=2.353299e-02
BinaryOp                 add_54                   1 1 88 89 0=0 1=1 2=5.462020e-05
Convolution              conv_54                  1 1 89 90 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=30720
MemoryData               p2o.pd_op.reshape.11.0   0 1 91 0=1 1=1 2=240
BinaryOp                 add_55                   2 1 90 91 92 0=0
BinaryOp                 mul_56                   1 1 92 93 0=2 1=1 2=1.523635e+00
BinaryOp                 add_57                   1 1 93 94 0=0 1=1 2=6.392852e-02
HardSwish                hswish_21                1 1 94 95 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_58                   1 1 95 96 0=2 1=1 2=5.249293e-01
BinaryOp                 add_59                   1 1 96 97 0=0 1=1 2=-1.167872e-02
ConvolutionDepthWise     convdw_93                1 1 97 98 0=240 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=0 6=6000 7=240
MemoryData               p2o.pd_op.reshape.12.0   0 1 99 0=1 1=1 2=240
BinaryOp                 add_60                   2 1 98 99 100 0=0
BinaryOp                 mul_61                   1 1 100 101 0=2 1=1 2=2.138868e+00
BinaryOp                 add_62                   1 1 101 102 0=0 1=1 2=-4.507720e-01
HardSwish                hswish_22                1 1 102 103 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_63                   1 1 103 104 0=2 1=1 2=1.181495e-01
BinaryOp                 add_64                   1 1 104 105 0=0 1=1 2=-6.013525e-05
Convolution              conv_55                  1 1 105 106 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=57600
MemoryData               p2o.pd_op.reshape.13.0   0 1 107 0=1 1=1 2=240
BinaryOp                 add_65                   2 1 106 107 108 0=0
BinaryOp                 mul_66                   1 1 108 109 0=2 1=1 2=2.044553e+00
BinaryOp                 add_67                   1 1 109 110 0=0 1=1 2=-2.431049e-01
HardSwish                hswish_23                1 1 110 111 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_68                   1 1 111 112 0=2 1=1 2=6.219931e-01
BinaryOp                 add_69                   1 1 112 113 0=0 1=1 2=8.859989e-02
ConvolutionDepthWise     convdw_94                1 1 113 114 0=240 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=0 6=6000 7=240
MemoryData               p2o.pd_op.reshape.14.0   0 1 115 0=1 1=1 2=240
BinaryOp                 add_70                   2 1 114 115 116 0=0
BinaryOp                 mul_71                   1 1 116 117 0=2 1=1 2=2.830977e+00
BinaryOp                 add_72                   1 1 117 118 0=0 1=1 2=1.021500e-01
HardSwish                hswish_24                1 1 118 119 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_73                   1 1 119 120 0=2 1=1 2=4.216631e-02
BinaryOp                 add_74                   1 1 120 121 0=0 1=1 2=-5.604238e-05
Convolution              conv_56                  1 1 121 122 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=57600
MemoryData               p2o.pd_op.reshape.15.0   0 1 123 0=1 1=1 2=240
BinaryOp                 add_75                   2 1 122 123 124 0=0
BinaryOp                 mul_76                   1 1 124 125 0=2 1=1 2=2.156336e+00
BinaryOp                 add_77                   1 1 125 126 0=0 1=1 2=-5.589596e-01
HardSwish                hswish_25                1 1 126 127 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_78                   1 1 127 128 0=2 1=1 2=5.327490e-01
BinaryOp                 add_79                   1 1 128 129 0=0 1=1 2=1.568191e-01
ConvolutionDepthWise     convdw_95                1 1 129 130 0=240 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=0 6=6000 7=240
MemoryData               p2o.pd_op.reshape.16.0   0 1 131 0=1 1=1 2=240
BinaryOp                 add_80                   2 1 130 131 132 0=0
BinaryOp                 mul_81                   1 1 132 133 0=2 1=1 2=2.506705e+00
BinaryOp                 add_82                   1 1 133 134 0=0 1=1 2=1.157011e+00
HardSwish                hswish_26                1 1 134 135 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_83                   1 1 135 136 0=2 1=1 2=4.520729e-02
BinaryOp                 add_84                   1 1 136 137 0=0 1=1 2=-3.584615e-06
Convolution              conv_57                  1 1 137 138 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=57600
MemoryData               p2o.pd_op.reshape.17.0   0 1 139 0=1 1=1 2=240
BinaryOp                 add_85                   2 1 138 139 140 0=0
BinaryOp                 mul_86                   1 1 140 141 0=2 1=1 2=2.150808e+00
BinaryOp                 add_87                   1 1 141 142 0=0 1=1 2=-5.547040e-01
HardSwish                hswish_27                1 1 142 143 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_88                   1 1 143 144 0=2 1=1 2=5.370421e-01
BinaryOp                 add_89                   1 1 144 145 0=0 1=1 2=1.735165e-01
ConvolutionDepthWise     convdw_96                1 1 145 146 0=240 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=0 6=6000 7=240
MemoryData               p2o.pd_op.reshape.18.0   0 1 147 0=1 1=1 2=240
BinaryOp                 add_90                   2 1 146 147 148 0=0
BinaryOp                 mul_91                   1 1 148 149 0=2 1=1 2=2.481236e+00
BinaryOp                 add_92                   1 1 149 150 0=0 1=1 2=1.145820e+00
HardSwish                hswish_28                1 1 150 151 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_93                   1 1 151 152 0=2 1=1 2=5.446845e-02
BinaryOp                 add_94                   1 1 152 153 0=0 1=1 2=4.943241e-05
Convolution              conv_58                  1 1 153 154 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=57600
MemoryData               p2o.pd_op.reshape.19.0   0 1 155 0=1 1=1 2=240
BinaryOp                 add_95                   2 1 154 155 156 0=0
BinaryOp                 mul_96                   1 1 156 157 0=2 1=1 2=2.169699e+00
BinaryOp                 add_97                   1 1 157 158 0=0 1=1 2=-6.480080e-01
HardSwish                hswish_29                1 1 158 159 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_98                   1 1 159 160 0=2 1=1 2=7.006389e-01
BinaryOp                 add_99                   1 1 160 161 0=0 1=1 2=2.380483e-01
ConvolutionDepthWise     convdw_97                1 1 161 162 0=240 1=5 11=5 12=1 13=2 14=2 2=1 3=1 4=2 5=0 6=6000 7=240
MemoryData               p2o.pd_op.reshape.20.0   0 1 163 0=1 1=1 2=240
BinaryOp                 add_100                  2 1 162 163 164 0=0
BinaryOp                 mul_101                  1 1 164 165 0=2 1=1 2=1.926186e+00
BinaryOp                 add_102                  1 1 165 166 0=0 1=1 2=4.542438e-01
HardSwish                hswish_30                1 1 166 167 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_103                  1 1 167 168 0=2 1=1 2=1.393038e+00
BinaryOp                 add_104                  1 1 168 169 0=0 1=1 2=-4.136366e-01
Split                    splitncnn_0              1 2 169 170 171
Pooling                  gap_5                    1 1 171 172 0=1 4=1
Convolution              convrelu_0               1 1 172 173 0=60 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=14400 9=1
Convolution              conv_60                  1 1 173 174 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=14400
HardSigmoid              hsigmoid_8               1 1 174 175 0=1.666667e-01 1=5.000000e-01
Reshape                  reshape_82               1 1 175 176 0=1 1=1 2=-1
BinaryOp                 mul_105                  2 1 170 176 177 0=2
Convolution              conv_61                  1 1 177 178 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=115200
MemoryData               p2o.pd_op.reshape.23.0   0 1 179 0=1 1=1 2=480
BinaryOp                 add_106                  2 1 178 179 180 0=0
BinaryOp                 mul_107                  1 1 180 181 0=2 1=1 2=2.592662e+00
BinaryOp                 add_108                  1 1 181 182 0=0 1=1 2=-4.306299e-01
HardSwish                hswish_31                1 1 182 183 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_109                  1 1 183 184 0=2 1=1 2=9.122257e-01
BinaryOp                 add_110                  1 1 184 185 0=0 1=1 2=2.021912e-01
ConvolutionDepthWise     convdw_98                1 1 185 186 0=480 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=0 6=12000 7=480
MemoryData               p2o.pd_op.reshape.24.0   0 1 187 0=1 1=1 2=480
BinaryOp                 add_111                  2 1 186 187 188 0=0
BinaryOp                 mul_112                  1 1 188 189 0=2 1=1 2=2.179476e+00
BinaryOp                 add_113                  1 1 189 190 0=0 1=1 2=2.459434e-01
HardSwish                hswish_32                1 1 190 191 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_114                  1 1 191 192 0=2 1=1 2=1.983662e+00
BinaryOp                 add_115                  1 1 192 193 0=0 1=1 2=-7.467775e-01
Split                    splitncnn_1              1 2 193 194 195
Pooling                  gap_6                    1 1 195 196 0=1 4=1
Convolution              convrelu_1               1 1 196 197 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600 9=1
Convolution              conv_63                  1 1 197 198 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600
HardSigmoid              hsigmoid_9               1 1 198 199 0=1.666667e-01 1=5.000000e-01
Reshape                  reshape_83               1 1 199 200 0=1 1=1 2=-1
BinaryOp                 mul_116                  2 1 194 200 201 0=2
Convolution              conv_64                  1 1 201 202 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=230400
MemoryData               p2o.pd_op.reshape.27.0   0 1 203 0=1 1=1 2=480
BinaryOp                 add_117                  2 1 202 203 204 0=0
BinaryOp                 mul_118                  1 1 204 205 0=2 1=1 2=2.586924e+00
BinaryOp                 add_119                  1 1 205 206 0=0 1=1 2=-8.015537e-01
HardSwish                hswish_33                1 1 206 207 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_120                  1 1 207 208 0=2 1=1 2=6.589833e-01
BinaryOp                 add_121                  1 1 208 209 0=0 1=1 2=2.119369e-01
ConvolutionDepthWise     convdw_99                1 1 209 210 0=480 1=5 11=5 12=1 13=2 14=2 2=1 3=1 4=2 5=0 6=12000 7=480
MemoryData               p2o.pd_op.reshape.28.0   0 1 211 0=1 1=1 2=480
BinaryOp                 add_122                  2 1 210 211 212 0=0
BinaryOp                 mul_123                  1 1 212 213 0=2 1=1 2=2.348032e+00
BinaryOp                 add_124                  1 1 213 214 0=0 1=1 2=1.665339e+00
HardSwish                hswish_34                1 1 214 215 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_125                  1 1 215 216 0=2 1=1 2=7.098751e-02
BinaryOp                 add_126                  1 1 216 217 0=0 1=1 2=2.780899e-04
Convolution              conv_65                  1 1 217 218 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=230400
MemoryData               p2o.pd_op.reshape.29.0   0 1 219 0=1 1=1 2=480
BinaryOp                 add_127                  2 1 218 219 220 0=0
BinaryOp                 mul_128                  1 1 220 221 0=2 1=1 2=3.173168e+00
BinaryOp                 add_129                  1 1 221 222 0=0 1=1 2=-6.365986e-01
HardSwish                hswish_35                1 1 222 223 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_130                  1 1 223 224 0=2 1=1 2=4.656531e-01
BinaryOp                 add_131                  1 1 224 225 0=0 1=1 2=1.285813e-01
ConvolutionDepthWise     convdw_100               1 1 225 226 0=480 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=0 6=12000 7=480
MemoryData               p2o.pd_op.reshape.30.0   0 1 227 0=1 1=1 2=480
BinaryOp                 add_132                  2 1 226 227 228 0=0
BinaryOp                 mul_133                  1 1 228 229 0=2 1=1 2=2.981040e+00
BinaryOp                 add_134                  1 1 229 230 0=0 1=1 2=1.155505e-01
HardSwish                hswish_36                1 1 230 231 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_135                  1 1 231 232 0=2 1=1 2=3.976384e-01
BinaryOp                 add_136                  1 1 232 233 0=0 1=1 2=2.775773e-05
Convolution              conv_66                  1 1 233 234 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=230400
MemoryData               p2o.pd_op.reshape.31.0   0 1 235 0=1 1=1 2=480
BinaryOp                 add_137                  2 1 234 235 236 0=0
BinaryOp                 mul_138                  1 1 236 237 0=2 1=1 2=3.725856e+00
BinaryOp                 add_139                  1 1 237 238 0=0 1=1 2=-3.639896e-01
HardSwish                hswish_37                1 1 238 239 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_140                  1 1 239 240 0=2 1=1 2=3.348482e+00
BinaryOp                 add_141                  1 1 240 241 0=0 1=1 2=-7.174185e-02
Pooling                  avgpool2d_7              1 1 241 242 0=1 1=2 11=3 12=3 13=0 2=2 3=0 5=1 6=0
Split                    splitncnn_2              1 2 242 243 244
Convolution              conv_67                  1 1 244 245 0=60 1=3 11=1 12=1 13=1 14=0 2=1 3=1 4=1 5=1 6=86400
Swish                    silu_40                  1 1 245 246
Convolution              conv_68                  1 1 246 247 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7200
Swish                    silu_41                  1 1 247 248
Reshape                  reshape_84               1 1 248 249 0=40 1=120
Permute                  permute_79               1 1 249 250 0=1
Split                    splitncnn_3              1 2 250 251 252
LayerNorm                ln_72                    1 1 252 253 0=120 1=1.000000e-05 2=1
MultiHeadAttention       attention_77             1 1 253 254 0=120 1=8 2=14400 3=120 4=120
BinaryOp                 add_142                  2 1 251 254 255 0=0
Split                    splitncnn_4              1 2 255 256 257
LayerNorm                ln_73                    1 1 257 258 0=120 1=1.000000e-05 2=1
Gemm                     gemm_0                   1 1 258 259 10=4 2=0 3=1 4=0 5=1 6=1 7=40 8=240 9=120
Swish                    silu_42                  1 1 259 260
Gemm                     gemm_1                   1 1 260 261 10=4 2=0 3=1 4=0 5=1 6=1 7=40 8=120 9=240
BinaryOp                 add_143                  2 1 256 261 262 0=0
Split                    splitncnn_5              1 2 262 263 264
LayerNorm                ln_74                    1 1 264 265 0=120 1=1.000000e-05 2=1
MultiHeadAttention       attention_78             1 1 265 266 0=120 1=8 2=14400 3=120 4=120
BinaryOp                 add_144                  2 1 263 266 267 0=0
Split                    splitncnn_6              1 2 267 268 269
LayerNorm                ln_75                    1 1 269 270 0=120 1=1.000000e-05 2=1
Gemm                     gemm_2                   1 1 270 271 10=4 2=0 3=1 4=0 5=1 6=1 7=40 8=240 9=120
Swish                    silu_43                  1 1 271 272
Gemm                     gemm_3                   1 1 272 273 10=4 2=0 3=1 4=0 5=1 6=1 7=40 8=120 9=240
BinaryOp                 add_145                  2 1 268 273 274 0=0
LayerNorm                ln_76                    1 1 274 275 0=120 1=1.000000e-06 2=1
Reshape                  reshape_85               1 1 275 276 0=120 1=40 2=1
Permute                  permute_80               1 1 276 277 0=4
Convolution              conv_69                  1 1 277 278 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600
Swish                    silu_44                  1 1 278 279
Concat                   cat_0                    2 1 243 279 280 0=0
Convolution              conv_70                  1 1 280 281 0=60 1=3 11=1 12=1 13=1 14=0 2=1 3=1 4=1 5=1 6=172800
Swish                    silu_45                  1 1 281 282
Convolution              conv_71                  1 1 282 283 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7200
Swish                    silu_46                  1 1 283 284
Squeeze                  squeeze_86               1 1 284 285 -23303=1,1
Permute                  permute_81               1 1 285 286 0=1
Gemm                     gemm_4                   1 1 286 287 10=4 2=0 3=1 4=0 5=1 6=1 7=40 8=6625 9=120
Softmax                  softmax_47               1 1 287 out0 0=1 1=1
